yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/**************************************************************************//**
 * @file     Driver_USART_SC_USART.c
 * @version  V1.00
 * @brief    USART driver for Nuvoton M55M1
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/*! \page Dirver_USART SC_USART

# Revision History

- Version 1.0
  - Initial release

# Requirements

This driver requires the M55M1 BSP.
The driver instance is mapped to hardware as shown in the table below:

  CMSIS Driver Instance | M55M1 Hardware Resource
  :---------------------|:-----------------------
  Driver_USART10        | SCUART0
  Driver_USART11        | SCUART1
  Driver_USART12        | SCUART2

*/


#ifdef    RTE_device_header
    #include  RTE_device_header
#else
    #include "RTE_Device/RTE_Device.h"
#endif

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "Driver_USART.h"
#include "NuMicro.h"
#include "cmsis_os2.h"

#include "drv_pdma.h"
#include "misc.h"

#define ARM_USART_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0)  /* driver version */

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion =
{
    ARM_USART_API_VERSION,
    ARM_USART_DRV_VERSION
};


// Compile-time configuration **************************************************

// Configuration depending on RTE_USART.h
// Check if at least one peripheral instance is configured in RTE_USART.h
#if    (!(RTE_USART10)  && \
        !(RTE_USART11)  && \
        !(RTE_USART12))
#warning  USART driver requires at least one UART/USART peripheral configured in RTE_USART.h
#else
#define DRIVER_CONFIG_VALID     1
#endif

// *****************************************************************************

#ifdef  DRIVER_CONFIG_VALID     // Driver code is available only if configuration is valid

// Macros
// Macro for section for RW info
#ifdef  USART_SECTION_NAME
    #define USARTn_SECTION_(name,n) __attribute__((section(name #n)))
    #define USARTn_SECTION(n)       USARTn_SECTION_(USART_SECTION_NAME,n)
#else
    #define USARTn_SECTION(n)
#endif

// Macro to create usart_ro_info and usart_rw_info (for U(S)ART instances)
#define SC_INFO_DEFINE(n,sc_n)                                                                              \
    static        RW_Info_t         usart##n##_rw_info USARTn_SECTION(n) =                                  \
                                                                                                            {                                                     \
                                                                                                                                                                  .drv_status = 0                                  \
                                                                                                            };                                                    \
    static  const USART_Info_t      usart##n##_info = {                                                     \
                                                                                                            SC##sc_n,                                        \
                                                                                                            &usart##n##_rw_info,                             \
                                                      };


// Macro for declaring functions (for instances)
#define FUNCS_DECLARE(n)                                                                                       \
    static  ARM_USART_CAPABILITIES  USART##n##_GetCapabilities (void);                                             \
    static  int32_t                 USART##n##_Initialize      (ARM_USART_SignalEvent_t cb_event);                 \
    static  int32_t                 USART##n##_Uninitialize    (void);                                             \
    static  int32_t                 USART##n##_PowerControl    (ARM_POWER_STATE state);                            \
    static  int32_t                 USART##n##_Send            (const void *data, uint32_t num);                   \
    static  int32_t                 USART##n##_Receive         (void *data, uint32_t num);                         \
    static  int32_t                 USART##n##_Transfer        (const void *data_out, void *data_in, uint32_t num);\
    static  uint32_t                USART##n##_GetTxCount      (void);                                             \
    static  uint32_t                USART##n##_GetRxCount      (void);                                             \
    static  int32_t                 USART##n##_Control         (uint32_t control, uint32_t arg);                   \
    static  ARM_USART_STATUS        USART##n##_GetStatus       (void);


// Macro for defining functions (for instances)
#define FUNCS_DEFINE(n)                                                                                                                                                                      \
    static  ARM_USART_CAPABILITIES  USART##n##_GetCapabilities (void)                                              { return USARTn_GetCapabilities (&usart##n##_info); }                         \
    static  int32_t                 USART##n##_Initialize      (ARM_USART_SignalEvent_t cb_event)                  { return USARTn_Initialize      (&usart##n##_info, cb_event); }               \
    static  int32_t                 USART##n##_Uninitialize    (void)                                              { return USARTn_Uninitialize    (&usart##n##_info); }                         \
    static  int32_t                 USART##n##_PowerControl    (ARM_POWER_STATE state)                             { return USARTn_PowerControl    (&usart##n##_info, state); }                  \
    static  int32_t                 USART##n##_Send            (const void *data, uint32_t num)                    { return USARTn_Send            (&usart##n##_info, data, num); }              \
    static  int32_t                 USART##n##_Receive         (void *data, uint32_t num)                          { return USARTn_Receive         (&usart##n##_info, data, num); }              \
    static  int32_t                 USART##n##_Transfer        (const void *data_out, void *data_in, uint32_t num) { return USARTn_Transfer        (&usart##n##_info, data_out, data_in, num); } \
    static  uint32_t                USART##n##_GetTxCount      (void)                                              { return USARTn_GetTxCount      (&usart##n##_info); }                         \
    static  uint32_t                USART##n##_GetRxCount      (void)                                              { return USARTn_GetRxCount      (&usart##n##_info); }                         \
    static  int32_t                 USART##n##_Control         (uint32_t control, uint32_t arg)                    { return USARTn_Control         (&usart##n##_info, control, arg); }           \
    static  ARM_USART_STATUS        USART##n##_GetStatus       (void)                                              { return USARTn_GetStatus       (&usart##n##_info); }

