yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
// Macro for defining driver structures (for instances)
#define USART_DRIVER(n)                 \
    ARM_DRIVER_USART Driver_USART##n = {    \
                                            USART_GetVersion,                     \
                                            USART##n##_GetCapabilities,           \
                                            USART##n##_Initialize,                \
                                            USART##n##_Uninitialize,              \
                                            USART##n##_PowerControl,              \
                                            USART##n##_Send,                      \
                                            USART##n##_Receive,                   \
                                            USART##n##_Transfer,                  \
                                            USART##n##_GetTxCount,                \
                                            USART##n##_GetRxCount,                \
                                            USART##n##_Control,                   \
                                            USART##n##_GetStatus,                 \
                                            USART_SetModemControl,                \
                                            USART_GetModemStatus                  \
                                       };

// Driver status
typedef struct
{
    uint8_t                       initialized  : 1;       // Initialized status: 0 - not initialized, 1 - initialized
    uint8_t                       powered      : 1;       // Power status:       0 - not powered,     1 - powered
    uint8_t                       configured   : 1;       // Configured status:  0 - not configured,  1 - configured
    uint8_t                       reserved     : 5;       // Reserved (for padding)
} DriverStatus_t;

// Rx trans
typedef struct
{
    uint8_t   *data;
    uint16_t  num_bytes;
    uint16_t  trans_count;
} RX_Trans_t;

// Tx trans
typedef struct
{
    uint8_t   *data;
    uint16_t  num_bytes;
    uint16_t  trans_count;
} TX_Trans_t;

// Instance run-time information (RW)
typedef struct
{
    ARM_USART_SignalEvent_t       cb_event;               // Event callback
    DriverStatus_t                drv_status;             // Driver status
    volatile uint8_t              rx_overflow;            // Receive data overflow detected (cleared on start of next receive operation)
    volatile uint8_t              rx_framing_error;       // Framing error detected on receive (cleared on start of next receive operation)
    volatile uint8_t              rx_parity_error;        // Parity error detected on receive (cleared on start of next receive operation)

    RX_Trans_t                    rx_trans;               // RX trans contrl
    TX_Trans_t                    tx_trans;               // TX trans contrl
} RW_Info_t;

// Instance compile-time information (RO)
// also contains pointer to run-time information
#define UART_HWTypeDef  SC_T

typedef struct
{
    UART_HWTypeDef               *ptr_UART;               // Pointer to SCUART handle
    RW_Info_t                    *ptr_rw_info;            // Pointer to run-time information (RW)
} USART_Info_t;


// Information definitions (for instances)
#if (RTE_USART10)
    SC_INFO_DEFINE(10, 0)
#endif
#if (RTE_USART11)
    SC_INFO_DEFINE(11, 1)
#endif
#if (RTE_USART12)
    SC_INFO_DEFINE(12, 2)
#endif

// List of available USART instance infos
static const USART_Info_t *const usart_info_list[] =
{
#if (RTE_USART10)
    &usart10_info,
#endif
#if (RTE_USART11)
    &usart11_info,
#endif
#if (RTE_USART12)
    &usart12_info,
#endif
    NULL
};

// Local functions prototypes
static const USART_Info_t       *USART_GetInfo(const UART_HWTypeDef *huart);
static ARM_DRIVER_VERSION       USART_GetVersion(void);
static ARM_USART_CAPABILITIES   USARTn_GetCapabilities(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_Initialize(const USART_Info_t *ptr_usart_info, ARM_USART_SignalEvent_t cb_event);
static int32_t                  USARTn_Uninitialize(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_PowerControl(const USART_Info_t *ptr_usart_info, ARM_POWER_STATE state);
static int32_t                  USARTn_Send(const USART_Info_t *ptr_usart_info, const void *data, uint32_t num);
static int32_t                  USARTn_Receive(const USART_Info_t *ptr_usart_info,       void *data, uint32_t num);
static int32_t                  USARTn_Transfer(const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num);
static uint32_t                 USARTn_GetTxCount(const USART_Info_t *ptr_usart_info);
static uint32_t                 USARTn_GetRxCount(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_Control(const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg);
static ARM_USART_STATUS         USARTn_GetStatus(const USART_Info_t *ptr_usart_info);
static int32_t                  USART_SetModemControl(ARM_USART_MODEM_CONTROL control);
static ARM_USART_MODEM_STATUS   USART_GetModemStatus(void);

// Local driver functions declarations (for instances)
#if (RTE_USART10)
    FUNCS_DECLARE(10)
#endif
#if (RTE_USART11)
    FUNCS_DECLARE(11)
#endif
#if (RTE_USART12)
    FUNCS_DECLARE(12)
#endif

// Auxiliary functions

/**
  \fn          USART_Info_t *USART_GetInfo (const UART_HWTypeDef *huart)
  \brief       Get pointer to USART_Info_t structure corresponding to specified huart.
  \param[in]   huart    Pointer to UART handle structure (UART_T/SC_T)
  \return      pointer to USART info structure (USART_Info_t)
*/
static const USART_Info_t *USART_GetInfo(const UART_HWTypeDef *huart)
{
    const USART_Info_t *ptr_usart_info;
    uint8_t    i;

    ptr_usart_info = NULL;
    i           = 0U;

    // Find UART which uses same huart handle as parameter ptr_UART
    for (i = 0U; i < (sizeof(usart_info_list) / sizeof(USART_Info_t *)); i++)
    {
        if (usart_info_list[i] != NULL)
        {
            if (usart_info_list[i]->ptr_UART == huart)
            {
                ptr_usart_info = usart_info_list[i];
                break;
            }
        }
    }

    return ptr_usart_info;
}
#if 0
/**
  \fn          void USARTn_Set_Pin (const UART_HWTypeDef *huart)
  \brief       Set USARTn multi function pin
  \param[in]   huart    Pointer to UART handle structure (UART_T/SC_T)
*/
static void USARTn_Set_Pin(const UART_HWTypeDef *huart)
{
    //NULL....
    (void)(huart);
}

/**
  \fn          void USARTn_Clear_Pin (const UART_HWTypeDef *huart)
  \brief       Clear USARTn multi function pin
  \param[in]   huart    Pointer to UART handle structure (UART_T/SC_T)
*/
static void USARTn_Clear_Pin(const UART_HWTypeDef *huart)
{
    //NULL....
    (void)(huart);
}
#endif
typedef struct
{
    UART_HWTypeDef *huart;
    int32_t irq_n;
} S_IRQ_SEL_t;


static S_IRQ_SEL_t uart_clock_table[] =
{
#if (RTE_USART10)
    {SC0, SC0_IRQn},
#endif
#if (RTE_USART11)
    {SC1, SC1_IRQn},
#endif
#if (RTE_USART12)
    {SC2, SC2_IRQn},
#endif

