yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
};

static S_IRQ_SEL_t *ClockIRQSelector(UART_HWTypeDef *huart)
{
    int cnt = sizeof(uart_clock_table) / sizeof(S_IRQ_SEL_t);
    int i;

    for (i = 0; i < cnt; i++)
    {
        if (uart_clock_table[i].huart == huart)
            return &uart_clock_table[i];
    }

    return NULL;
}


/**
  \fn          void USARTn_Set_NVIC (const USART_T *huart)
  \brief       Set USARTn NVIC
  \param[in]   huart    Pointer to USART handle structure (SC_T)
*/
static void USARTn_Set_ClockNVIC(const USART_Info_t *ptr_usart_info)
{
    SC_T *huart = ptr_usart_info->ptr_UART;

    S_IRQ_SEL_t *irq_sel;

    irq_sel = ClockIRQSelector(huart);

    if (irq_sel == NULL)
    {
        printf("Error! unable select UART clock table \n");
        return;
    }

    /* Unlock protected registers */
    SYS_UnlockReg();

    NVIC_EnableIRQ(irq_sel->irq_n);

    /* Lock protected registers */
    SYS_LockReg();
}

/**
  \fn          void USARTn_Clear_NVIC (const USART_T *huart)
  \brief       Clear USARTn clock and NVIC
  \param[in]   huart    Pointer to USART handle structure (SC_T)
*/
static void USARTn_Clear_ClockNVIC(const USART_Info_t *ptr_usart_info)
{
    SC_T *huart = ptr_usart_info->ptr_UART;

    S_IRQ_SEL_t *irq_sel;

    irq_sel = ClockIRQSelector(huart);

    if (irq_sel == NULL)
    {
        printf("Error! unable select SC irq table \n");
        return;
    }

    /* Unlock protected registers */
    SYS_UnlockReg();

    NVIC_DisableIRQ(irq_sel->irq_n);

    /* Lock protected registers */
    SYS_LockReg();
}

// Driver functions ************************************************************

/**
  \fn          ARM_DRIVER_VERSION USART_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USART_GetVersion(void)
{
    return DriverVersion;
}

/**
  \fn          ARM_USART_CAPABILITIES USARTn_GetCapabilities (const RO_Info_t * const ptr_ro_info)
  \brief       Get driver capabilities.
  \param[in]   ptr_ro_info     Pointer to USART RO info structure (RO_Info_t)
  \return      \ref ARM_USART_CAPABILITIES
*/
static ARM_USART_CAPABILITIES USARTn_GetCapabilities(const USART_Info_t *ptr_usart_info)
{
    (void)(ptr_usart_info);

    ARM_USART_CAPABILITIES driver_capabilities;

    // Clear capabilities structure
    memset(&driver_capabilities, 0, sizeof(ARM_USART_CAPABILITIES));

    // Load capability fields different than 0
    driver_capabilities.asynchronous = 1U;
    driver_capabilities.event_tx_complete = 1U;
    driver_capabilities.flow_control_rts = 0U;
    driver_capabilities.flow_control_cts = 0U;

    return driver_capabilities;
}

/**
  \fn          int32_t USARTn_Initialize (const RO_Info_t * const ptr_ro_info, ARM_USART_SignalEvent_t cb_event)
  \brief       Initialize USART Interface.
  \param[in]   ptr_ro_info     Pointer to USART RO info structure (RO_Info_t)
  \param[in]   cb_event        Pointer to \ref ARM_USART_SignalEvent
  \return      \ref execution_status
*/
static int32_t USARTn_Initialize(const USART_Info_t *ptr_usart_info, ARM_USART_SignalEvent_t cb_event)
{

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    // Clear run-time info
    memset((void *)ptr_rw_info, 0, sizeof(RW_Info_t));

    // Register callback function
    ptr_rw_info->cb_event = cb_event;

    // Set driver status to initialized
    ptr_rw_info->drv_status.initialized = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Uninitialize (const RO_Info_t * const ptr_ro_info)
  \brief       De-initialize USART Interface.
  \param[in]   ptr_ro_info     Pointer to USART RO info structure (RO_Info_t)
  \return      \ref execution_status
*/
static int32_t USARTn_Uninitialize(const USART_Info_t *ptr_usart_info)
{

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    // Clear run-time info
    memset((void *)ptr_rw_info, 0, sizeof(RW_Info_t));

    // Set driver status to uninitialized
    ptr_rw_info->drv_status.initialized = 0U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_PowerControl (const RO_Info_t * const ptr_ro_info, ARM_POWER_STATE state)
  \brief       Control USART Interface Power.
  \param[in]   ptr_ro_info     Pointer to USART RO info structure (RO_Info_t)
  \param[in]   state           Power state
  \return      \ref execution_status
*/
static int32_t USARTn_PowerControl(const USART_Info_t *ptr_usart_info, ARM_POWER_STATE state)
{

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    switch (state)
    {
        case ARM_POWER_FULL:
            if (ptr_rw_info->drv_status.initialized == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            // Clear communication error status
            ptr_rw_info->rx_overflow      = 0U;
            ptr_rw_info->rx_framing_error = 0U;
            ptr_rw_info->rx_parity_error  = 0U;

            // Initialize pins, clocks, interrupts and peripheral
            USARTn_Set_ClockNVIC(ptr_usart_info);

            SCUART_Open(ptr_usart_info->ptr_UART, 0);


            // Set driver status to powered
            ptr_rw_info->drv_status.powered = 1U;
            break;

        case ARM_POWER_OFF:

            // If send operation is in progress, abort it
            if (USARTn_GetStatus(ptr_usart_info).tx_busy != 0U)
            {
                (void)USARTn_Control(ptr_usart_info, ARM_USART_ABORT_SEND, 0U);
            }

            // If receive operation is in progress, abort it
            if (USARTn_GetStatus(ptr_usart_info).rx_busy != 0U)
            {
                (void)USARTn_Control(ptr_usart_info, ARM_USART_ABORT_RECEIVE, 0U);
            }

            // De-initialize pins, clocks, interrupts and peripheral
            SCUART_Close(ptr_usart_info->ptr_UART);
            USARTn_Clear_ClockNVIC(ptr_usart_info);

            // Set driver status to not powered
            ptr_rw_info->drv_status.powered = 0U;

            // Clear communication error status
            ptr_rw_info->rx_overflow      = 0U;
            ptr_rw_info->rx_framing_error = 0U;
            ptr_rw_info->rx_parity_error  = 0U;
            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Send (const RO_Info_t * const ptr_ro_info, const void *data, uint32_t num)
  \brief       Start sending data to USART transmitter.
  \param[in]   ptr_usart_info     Pointer to USART RO info structure (RO_Info_t)
  \param[in]   data            Pointer to buffer with data to send to USART transmitter
  \param[in]   num             Number of data items to send
  \return      \ref execution_status
*/
static int32_t USARTn_Send(const USART_Info_t *ptr_usart_info, const void *data, uint32_t num)
{
    ARM_USART_STATUS usart_status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    TX_Trans_t *ptr_tx_trans = &ptr_rw_info->tx_trans;

    if ((data == NULL) || (num == 0U) || (num > (uint32_t)UINT16_MAX))
    {
        // If any parameter is invalid
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

