yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
    usart_status = USARTn_GetStatus(ptr_usart_info);

    if (usart_status.tx_busy)
        return ARM_DRIVER_ERROR_BUSY;

    ptr_tx_trans->data = (uint8_t *)data;
    ptr_tx_trans->num_bytes = num;
    ptr_tx_trans->trans_count = 0;

    //Use IRQ transfer mode
    SCUART_ENABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_TBEIEN_Msk | SC_INTEN_TERRIEN_Msk));

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Receive (const USART_Info_t *ptr_usart_info, void *data, uint32_t num)
  \brief       Start receiving data from USART receiver.
  \param[in]   ptr_usart_info  Pointer to USART RO info structure (RO_Info_t)
  \param[out]  data            Pointer to buffer for data to receive from USART receiver
  \param[in]   num             Number of data items to receive
  \return      \ref execution_status
*/
static int32_t USARTn_Receive(const USART_Info_t *ptr_usart_info, void *data, uint32_t num)
{
    ARM_USART_STATUS usart_status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    RX_Trans_t *ptr_rx_trans = &ptr_rw_info->rx_trans;

    if ((data == NULL) || (num == 0U) || (num > (uint32_t)UINT16_MAX))
    {
        // If any parameter is invalid
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    usart_status = USARTn_GetStatus(ptr_usart_info);

    if (usart_status.rx_busy)
        return ARM_DRIVER_ERROR_BUSY;

    ptr_rx_trans->data = (uint8_t *)data;
    ptr_rx_trans->num_bytes = num;
    ptr_rx_trans->trans_count = 0;

    // Clear communication error status
    ptr_rw_info->rx_overflow      = 0U;
    ptr_rw_info->rx_framing_error = 0U;
    ptr_rw_info->rx_parity_error  = 0U;

    //Use IRQ transfer mode
    SCUART_ENABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_RDAIEN_Msk | SC_INTEN_RXTOIEN_Msk | SC_INTEN_TERRIEN_Msk));

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Transfer (const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num)
  \brief       Start sending/receiving data to/from USART transmitter/receiver.
  \param[in]   ptr_usart_info  Pointer to USART info structure (USART_Info_t)
  \param[in]   data_out        Pointer to buffer with data to send to USART transmitter
  \param[out]  data_in         Pointer to buffer for data to receive from USART receiver
  \param[in]   num             Number of data items to transfer
  \return      \ref execution_status
*/
static int32_t USARTn_Transfer(const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num)
{
    (void)data_out;
    (void)data_in;
    (void)num;
    (void)ptr_usart_info;

    if (ptr_usart_info->ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Supported only in Synchronous mode
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}


/**
  \fn          uint32_t USARTn_GetTxCount (const USART_Info_t *ptr_usart_info)
  \brief       Get transmitted data count.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \return      number of data items transmitted
*/
static uint32_t USARTn_GetTxCount(const USART_Info_t *ptr_usart_info)
{
    uint32_t cnt;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    //TBD..
    //TX_Trans_t *ptr_tx_trans = &ptr_rw_info->tx_trans;

    if (ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    cnt = (uint32_t)ptr_rw_info->tx_trans.trans_count;

    return cnt;
}

/**
  \fn          uint32_t USARTn_GetRxCount (const USART_Info_t *ptr_usart_info)
  \brief       Get received data count.
  \param[in]   ptr_ro_info     Pointer to USART info structure (USART_Info_t)
  \return      number of data items received
*/
static uint32_t USARTn_GetRxCount(const USART_Info_t *ptr_usart_info)
{
    uint32_t cnt;

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    //TBD..
    //RX_Trans_t *ptr_rx_trans = &ptr_rw_info->rx_trans;

    if (ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    cnt = (uint32_t)ptr_rw_info->rx_trans.trans_count;

    return cnt;
}

/**
  \fn          int32_t USARTn_Control (const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg)
  \brief       Control USART Interface.
  \param[in]   ptr_ro_info     Pointer to USART info structure (USART_Info_t)
  \param[in]   control         Operation
  \param[in]   arg             Argument of operation (optional)
  \return      common \ref execution_status and driver specific \ref usart_execution_status
*/
static int32_t USARTn_Control(const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg)
{
    ARM_USART_STATUS status;
    uint8_t          parity_bits;
    uint32_t         word_len;
    uint32_t         parity = UART_PARITY_NONE;
    uint32_t         stop_bits = UART_STOP_BIT_1;
    uint32_t         baud_rate = 0;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    if (ptr_usart_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Special handling for Abort Send command
    if ((control & ARM_USART_CONTROL_Msk) == ARM_USART_ABORT_SEND)
    {
        SCUART_DISABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_TBEIEN_Msk | SC_INTEN_TERRIEN_Msk));

        ptr_rw_info->tx_trans.data = NULL;
        ptr_rw_info->tx_trans.num_bytes = 0;
        ptr_rw_info->tx_trans.trans_count = 0;
        return ARM_DRIVER_OK;
    }

    // Special handling for Abort Receive command
    if ((control & ARM_USART_CONTROL_Msk) == ARM_USART_ABORT_RECEIVE)
    {
        SCUART_DISABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_RDAIEN_Msk | SC_INTEN_RXTOIEN_Msk));

        ptr_rw_info->rx_trans.data = NULL;
        ptr_rw_info->rx_trans.num_bytes = 0;
        ptr_rw_info->rx_trans.trans_count = 0;
        return ARM_DRIVER_OK;
    }

    // Check if peripheral is busy
    status = USARTn_GetStatus(ptr_usart_info);

    if ((status.tx_busy != 0U) || (status.rx_busy != 0U))
    {
        return ARM_DRIVER_ERROR_BUSY;
    }


