yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
    switch (control & ARM_USART_CONTROL_Msk)      // --- Control: Mode and Miscellaneous
    {
        // --- Control Mode
        case ARM_USART_MODE_ASYNCHRONOUS:           // Mode: Asynchronous
            ptr_rw_info->drv_status.configured = 0U;
            break;                                    // Continue configuring parameters after this switch block

        case ARM_USART_MODE_SYNCHRONOUS_MASTER:     // Mode: Synchronous Master
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE:      // Mode: Synchronous Slave
        case ARM_USART_MODE_SINGLE_WIRE:            // Mode: Single-wire
        case ARM_USART_MODE_IRDA:                   // Mode: IrDA
        case ARM_USART_MODE_SMART_CARD:             // Mode: Smart Card
            return ARM_USART_ERROR_MODE;

        // --- Control Miscellaneous
        case ARM_USART_CONTROL_TX:                  // Transmitter; arg: 0=disabled, 1=enabled
            if (arg != 0U)
            {
                // Enable transmitter
                //UART_ENABLE_INT(ptr_usart_info->ptr_UART, UART_INTEN_THREIEN_Msk);
            }
            else
            {
                // Disable transmitter
                SCUART_DISABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_TBEIEN_Msk | SC_INTEN_TERRIEN_Msk));
            }

            return ARM_DRIVER_OK;

        case ARM_USART_CONTROL_RX:                  // Receiver; arg: 0=disabled, 1=enabled
            if (arg != 0U)
            {
                // Enable receiver
                //UART_ENABLE_INT(ptr_usart_info->ptr_UART, UART_INTEN_RDAIEN_Msk);
            }
            else
            {
                SCUART_DISABLE_INT(ptr_usart_info->ptr_UART, (SC_INTEN_RDAIEN_Msk | SC_INTEN_RXTOIEN_Msk));
            }

            return ARM_DRIVER_OK;

        case ARM_USART_SET_DEFAULT_TX_VALUE:        // Set default Transmit value
        case ARM_USART_SET_IRDA_PULSE:              // Set IrDA Pulse in ns
        case ARM_USART_SET_SMART_CARD_GUARD_TIME:   // Set Smart Card Guard Time
        case ARM_USART_SET_SMART_CARD_CLOCK:        // Set Smart Card Clock in Hz
        case ARM_USART_CONTROL_SMART_CARD_NACK:     // Smart Card NACK generation
        case ARM_USART_CONTROL_BREAK:               // Continuous Break transmission
        case ARM_USART_ABORT_TRANSFER:              // Abort ARM_USART_Transfer
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:                                    // Unknown Control
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Configure all other parameters if command was to set Asynchronous mode (ARM_USART_MODE_ASYNCHRONOUS)

    // Determine number of parity bits used
    parity_bits = 0U;

    if ((control & ARM_USART_PARITY_Msk) != ARM_USART_PARITY_NONE)
    {
        parity_bits = 1U;
    }


    switch (control & ARM_USART_DATA_BITS_Msk)    // --- Mode Parameters: Data Bits
    {
        case ARM_USART_DATA_BITS_6:                 // Data bits: 6

            if (parity_bits == 1U)
            {
                word_len = SCUART_CHAR_LEN_7;
            }
            else
            {
                word_len = SCUART_CHAR_LEN_6;
            }

            break;

        case ARM_USART_DATA_BITS_7:                 // Data bits: 7

            if (parity_bits == 1U)
            {
                word_len = SCUART_CHAR_LEN_8;
            }
            else
            {
                word_len = SCUART_CHAR_LEN_7;
            }

            break;

        case ARM_USART_DATA_BITS_8:                 // Data bits: 8

            if (parity_bits == 1U)
            {
                return ARM_USART_ERROR_DATA_BITS;
            }
            else
            {
                word_len = SCUART_CHAR_LEN_8;
            }

            break;

        default:
            return ARM_USART_ERROR_DATA_BITS;
    }

    switch (control & ARM_USART_PARITY_Msk)       // --- Mode Parameters: Parity
    {
        case ARM_USART_PARITY_NONE:                 // Parity: none
            parity = SCUART_PARITY_NONE;
            break;

        case ARM_USART_PARITY_EVEN:                 // Parity: even
            parity = SCUART_PARITY_EVEN;
            break;

        case ARM_USART_PARITY_ODD:                  // Parity: odd
            parity = SCUART_PARITY_ODD;
            break;

        default:
            return ARM_USART_ERROR_PARITY;
    }

    switch (control & ARM_USART_STOP_BITS_Msk)    // --- Mode Parameters: Stop Bits
    {
        case ARM_USART_STOP_BITS_1:                 // Stop Bits: 1
            stop_bits = SCUART_STOP_BIT_1;
            break;

        case ARM_USART_STOP_BITS_2:                 // Stop Bits: 2
            stop_bits = SCUART_STOP_BIT_2;
            break;

        case ARM_USART_STOP_BITS_1_5:                // Stop Bits: 1.5

        default:
            return ARM_USART_ERROR_STOP_BITS;
    }

    switch (control & ARM_USART_FLOW_CONTROL_Msk)   // --- Mode Parameters: Flow Control
    {
        case ARM_USART_FLOW_CONTROL_NONE:             // Flow Control: none
            break;

        case ARM_USART_FLOW_CONTROL_RTS:              // Flow Control: RTS
        case ARM_USART_FLOW_CONTROL_CTS:              // Flow Control: CTS
        case ARM_USART_FLOW_CONTROL_RTS_CTS:          // Flow Control: RTS/CTS

        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    baud_rate = arg;

    SCUART_SetLineConfig(ptr_usart_info->ptr_UART, baud_rate, word_len, parity, stop_bits);

    // Set driver status to configured
    ptr_rw_info->drv_status.configured = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USART_STATUS USARTn_GetStatus (const USART_Info_t * const ptr_ro_info)
  \brief       Get USART status.
  \param[in]   ptr_ro_info     Pointer to USART info structure (USART_Info_t)
  \return      USART status \ref ARM_USART_STATUS
*/
static ARM_USART_STATUS USARTn_GetStatus(const USART_Info_t *ptr_usart_info)
{
    ARM_USART_STATUS status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

