yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_SC_UART.c
    // Clear status structure
    memset(&status, 0, sizeof(ARM_USART_STATUS));

    if (ptr_rw_info->tx_trans.num_bytes != ptr_rw_info->tx_trans.trans_count)
        status.tx_busy = 1U;

    if (ptr_rw_info->rx_trans.num_bytes != ptr_rw_info->rx_trans.trans_count)
        status.rx_busy = 1U;

    // Process additionally handled communication information
    if (ptr_rw_info->rx_overflow != 0U)
    {
        status.rx_overflow = 1U;
    }

    if (ptr_rw_info->rx_framing_error != 0U)
    {
        status.rx_framing_error = 1U;
    }

    if (ptr_rw_info->rx_parity_error != 0U)
    {
        status.rx_parity_error = 1U;
    }

    return status;
}

/**
  \fn          int32_t USART_SetModemControl (ARM_USART_MODEM_CONTROL control)
  \brief       Set USART Modem Control line state.
  \param[in]   control  \ref ARM_USART_MODEM_CONTROL
  \return      \ref execution_status
*/
static int32_t USART_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    (void)control;

    // Manual control of modem control lines is not supported by HAL
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}

/**
  \fn          ARM_USART_MODEM_STATUS USART_GetModemStatus (void)
  \brief       Get USART Modem Status lines state.
  \return      modem status \ref ARM_USART_MODEM_STATUS
*/
static ARM_USART_MODEM_STATUS USART_GetModemStatus(void)
{
    ARM_USART_MODEM_STATUS modem_status;

    // Retrieving modem control lines status information is supported by HAL
    memset(&modem_status, 0, sizeof(ARM_USART_MODEM_STATUS));

    return modem_status;
}

// UART IRQ handler
static void USARTn_IRQHandler(const USART_Info_t *ptr_usart_info)
{
    UART_HWTypeDef *huart = ptr_usart_info->ptr_UART;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    uint32_t u32IRQStatus = huart->INTSTS;

    if (SCUART_GET_INT_FLAG(huart, SC_INTSTS_RDAIF_Msk))
    {
        RX_Trans_t *ptr_rx_trans;
        uint8_t u8InChar = 0xFF;
        ptr_rx_trans = &ptr_rw_info->rx_trans;

        /* Get all the input characters */
        while (SCUART_IS_RX_READY(huart))
        {
            /* Get the character from UART Buffer */
            u8InChar = SCUART_READ(huart);

            /* Put buffer */
            if (ptr_rx_trans->data)
            {
                if (ptr_rx_trans->num_bytes > ptr_rx_trans->trans_count)
                {
                    ptr_rx_trans->data[ptr_rx_trans->trans_count] = u8InChar;
                    ptr_rx_trans->trans_count ++;
                }

                if (ptr_rx_trans->num_bytes == ptr_rx_trans->trans_count)
                {
                    if (ptr_rw_info->cb_event)
                        ptr_rw_info->cb_event(ARM_USART_EVENT_RECEIVE_COMPLETE);
                }
            }
        }
    }

    if (SCUART_GET_INT_FLAG(huart, SC_INTSTS_TBEIF_Msk))
    {
        TX_Trans_t *ptr_tx_trans;
        uint8_t u8OutChar;
        ptr_tx_trans = &ptr_rw_info->tx_trans;

        if (ptr_tx_trans->data)
        {
            if (ptr_tx_trans->num_bytes > ptr_tx_trans->trans_count)
            {
                for (uint32_t i = 0; i < 2; i++)
                {
                    u8OutChar = ptr_tx_trans->data[ptr_tx_trans->trans_count];
                    ptr_tx_trans->trans_count++;
                    SCUART_WRITE(huart, u8OutChar);

                    if (ptr_tx_trans->num_bytes == ptr_tx_trans->trans_count)
                    {
                        SCUART_DISABLE_INT(huart, (SC_INTEN_TBEIEN_Msk));
                        break;
                    }
                }

                if (ptr_rw_info->cb_event)
                    ptr_rw_info->cb_event(ARM_USART_EVENT_TX_COMPLETE | ARM_USART_EVENT_SEND_COMPLETE);
            }
        }
    }

    uint32_t   event = 0;

    if (huart->STATUS & (SC_STATUS_FEF_Msk))
    {
        event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
        ptr_rw_info->rx_framing_error = 1U;
        huart->STATUS = SC_STATUS_FEF_Msk;
    }

    if (huart->STATUS & (SC_STATUS_PEF_Msk))
    {
        event |= ARM_USART_EVENT_RX_PARITY_ERROR;
        ptr_rw_info->rx_parity_error = 1U;
        huart->STATUS = SC_STATUS_PEF_Msk;
    }

    if (huart->STATUS & (SC_STATUS_RXOV_Msk))
    {
        event |= ARM_USART_EVENT_RX_OVERFLOW;
        ptr_rw_info->rx_overflow = 1U;
        huart->STATUS = UART_FIFOSTS_RXOVIF_Msk;
    }

    if ((ptr_rw_info->cb_event != NULL) && (event != 0U))
    {
        ptr_rw_info->cb_event(event);
    }

    //Clear RLSINT and BUFERRINT flag
    if (huart->STATUS & (SC_STATUS_BEF_Msk | SC_STATUS_FEF_Msk | SC_STATUS_PEF_Msk | SC_STATUS_RXOV_Msk | SC_STATUS_TXOV_Msk))
    {
        SCUART_CLR_INT_FLAG(huart, (SC_INTSTS_TERRIF_Msk));
    }

    //Clear all int flag
    huart->INTSTS = u32IRQStatus;
    u32IRQStatus = huart->INTSTS;
}

#if (RTE_USART10)
NVT_ITCM void SC0_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(SC0);

    if (prt_usart_info)
    {
        USARTn_IRQHandler(prt_usart_info);
    }

}
#endif

#if (RTE_USART11)
NVT_ITCM void SC1_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(SC1);

    if (prt_usart_info)
    {
        USARTn_IRQHandler(prt_usart_info);
    }

}
#endif

#if (RTE_USART12)
NVT_ITCM void SC2_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(SC2);

    if (prt_usart_info)
    {
        USARTn_IRQHandler(prt_usart_info);
    }

}
#endif

// Local driver functions definitions (for instances)
#if (RTE_USART10)
    FUNCS_DEFINE(10)
#endif
#if (RTE_USART11)
    FUNCS_DEFINE(11)
#endif
#if (RTE_USART12)
    FUNCS_DEFINE(12)
#endif


// Global driver structures ****************************************************
#if (RTE_USART10)
    USART_DRIVER(10)
#endif
#if (RTE_USART11)
    USART_DRIVER(11)
#endif
#if (RTE_USART12)
    USART_DRIVER(12)
#endif


#endif  // DRIVER_CONFIG_VALID